# Pandas methods testing

### Creating, loading, and saving of data

In [1]:
# Creation
people = {
    'first' : ['ginger', 'baddie', 'mickey', 'meggy'],
    'last' : ['bread', 'baldie', 'mann', 'muffin'],
    'email' : ['gingerbread@email.com', 'baddiebaldie@email.com', 'mickeymann@email.com', 'meggymuffin@email.com'],
    'sex' : ['male', 'female', 'male', 'female'],
    'age' : [18, 27, 33, 15],
}

In [2]:
# Loading
import pandas as pd

people_dataframe = pd.DataFrame(people)
people_dataframe

    first    last                   email     sex  age
0  ginger   bread   gingerbread@email.com    male   18
1  baddie  baldie  baddiebaldie@email.com  female   27
2  mickey    mann    mickeymann@email.com    male   33
3   meggy  muffin   meggymuffin@email.com  female   15

In [3]:
# Saving to csv
people_dataframe.to_csv('data/people_dataframe.csv')

In [4]:
# Loading from csv file
people_dataframe = pd.read_csv(r'data\people_dataframe.csv', index_col=0)
people_dataframe

    first    last                   email     sex  age
0  ginger   bread   gingerbread@email.com    male   18
1  baddie  baldie  baddiebaldie@email.com  female   27
2  mickey    mann    mickeymann@email.com    male   33
3   meggy  muffin   meggymuffin@email.com  female   15

### Displaying of dataframe and information about it

In [5]:
# Displaying first 5 rows of dataframe
people_dataframe.head(5)

    first    last                   email     sex  age
0  ginger   bread   gingerbread@email.com    male   18
1  baddie  baldie  baddiebaldie@email.com  female   27
2  mickey    mann    mickeymann@email.com    male   33
3   meggy  muffin   meggymuffin@email.com  female   15

In [6]:
# Setting display option of dataframe
pd.set_option('display.max_columns', 20)

In [7]:
# Showing numbers of rows  and columns
people_dataframe.shape

(4, 5)

In [8]:
# Showing the columns' information
people_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   first   4 non-null      object
 1   last    4 non-null      object
 2   email   4 non-null      object
 3   sex     4 non-null      object
 4   age     4 non-null      int64
dtypes: int64(1), object(4)
memory usage: 192.0+ bytes

In [9]:
# Statistics about the dataframe
people_dataframe.describe()

             age
count   4.000000
mean   23.250000
std     8.261356
min    15.000000
25%    17.250000
50%    22.500000
75%    28.500000
max    33.000000

### Selecting rows and columns

In [10]:
# Selecting columns
people_dataframe['email']

0     gingerbread@email.com
1    baddiebaldie@email.com
2      mickeymann@email.com
3     meggymuffin@email.com
Name: email, dtype: object

In [11]:
# Selecting multiple columns
people_dataframe[['first', 'last', 'email']]

    first    last                   email
0  ginger   bread   gingerbread@email.com
1  baddie  baldie  baddiebaldie@email.com
2  mickey    mann    mickeymann@email.com
3   meggy  muffin   meggymuffin@email.com

In [12]:
# Selecting rows by index
people_dataframe.iloc[0]

first                   ginger
last                     bread
email    gingerbread@email.com
sex                       male
age                         18
Name: 0, dtype: object

In [13]:
# Selecting multiple rows by index
people_dataframe.iloc[[0,1], 2]

0     gingerbread@email.com
1    baddiebaldie@email.com
Name: email, dtype: object

In [14]:
# Selecting multiple rows with selected columns by index
people_dataframe.iloc[[0,1], [2,3]]

                    email     sex
0   gingerbread@email.com    male
1  baddiebaldie@email.com  female

In [15]:
# Selecting multiple rows with selected columns by label
people_dataframe.loc[[0,1], ['email', 'sex']]

                    email     sex
0   gingerbread@email.com    male
1  baddiebaldie@email.com  female

In [16]:
# Getting single value
people_dataframe.at[0, 'first']

'ginger'

### Filtering the data frame

In [17]:
# Searching through the data frame with given conditions
filt = (people_dataframe['age'] <= 20)
people_dataframe.loc[filt]

    first    last                  email     sex  age
0  ginger   bread  gingerbread@email.com    male   18
3   meggy  muffin  meggymuffin@email.com  female   15

In [18]:
# Searching through the data frame by given conditions with selected columns
people_dataframe.loc[filt, ['first', 'last', 'age']]

    first    last  age
0  ginger   bread   18
3   meggy  muffin   15

### Set, reset, sort, and use index

In [19]:
# Showing index
people_dataframe.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [20]:
# Setting index
people_dataframe.set_index('email', inplace=True)

In [21]:
# Dataframe after index set
people_dataframe

                         first    last     sex  age
email
gingerbread@email.com   ginger   bread    male   18
baddiebaldie@email.com  baddie  baldie  female   27
mickeymann@email.com    mickey    mann    male   33
meggymuffin@email.com    meggy  muffin  female   15

In [22]:
# Selecting row by idex
people_dataframe.loc['mickeymann@email.com']

first    mickey
last       mann
sex        male
age          33
Name: mickeymann@email.com, dtype: object

In [23]:
# Resetting index
people_dataframe.reset_index(inplace=True)

In [24]:
# Dataframe after index reset
people_dataframe

                    email   first    last     sex  age
0   gingerbread@email.com  ginger   bread    male   18
1  baddiebaldie@email.com  baddie  baldie  female   27
2    mickeymann@email.com  mickey    mann    male   33
3   meggymuffin@email.com   meggy  muffin  female   15

In [25]:
# Sorting index
people_dataframe.sort_index(ascending=False)

                    email   first    last     sex  age
3   meggymuffin@email.com   meggy  muffin  female   15
2    mickeymann@email.com  mickey    mann    male   33
1  baddiebaldie@email.com  baddie  baldie  female   27
0   gingerbread@email.com  ginger   bread    male   18

### Modifying data within dataframe

In [26]:
# Renaming columns
people_dataframe.columns = ['email', 'first', 'last', 'sex', 'age']
people_dataframe

                    email   first    last     sex  age
0   gingerbread@email.com  ginger   bread    male   18
1  baddiebaldie@email.com  baddie  baldie  female   27
2    mickeymann@email.com  mickey    mann    male   33
3   meggymuffin@email.com   meggy  muffin  female   15

In [27]:
# Renaming columns using mapping
people_dataframe.rename(columns={'first' : 'first name', 'last' : 'last name'}, inplace=True)
people_dataframe

                    email first name last name     sex  age
0   gingerbread@email.com     ginger     bread    male   18
1  baddiebaldie@email.com     baddie    baldie  female   27
2    mickeymann@email.com     mickey      mann    male   33
3   meggymuffin@email.com      meggy    muffin  female   15

In [28]:
# Modifying columns with string manipulation
people_dataframe.columns = people_dataframe.columns.str.replace(' ', '_')
people_dataframe

                    email first_name last_name     sex  age
0   gingerbread@email.com     ginger     bread    male   18
1  baddiebaldie@email.com     baddie    baldie  female   27
2    mickeymann@email.com     mickey      mann    male   33
3   meggymuffin@email.com      meggy    muffin  female   15

In [29]:
# Modifying columns with list comprehension
people_dataframe.columns = [x.upper() for x in people_dataframe.columns]
people_dataframe

                    EMAIL FIRST_NAME LAST_NAME     SEX  AGE
0   gingerbread@email.com     ginger     bread    male   18
1  baddiebaldie@email.com     baddie    baldie  female   27
2    mickeymann@email.com     mickey      mann    male   33
3   meggymuffin@email.com      meggy    muffin  female   15

In [30]:
# Modifying columns with string manipulation
people_dataframe.columns = people_dataframe.columns.str.lower()
people_dataframe

                    email first_name last_name     sex  age
0   gingerbread@email.com     ginger     bread    male   18
1  baddiebaldie@email.com     baddie    baldie  female   27
2    mickeymann@email.com     mickey      mann    male   33
3   meggymuffin@email.com      meggy    muffin  female   15

In [31]:
# Modifying row values by index
people_dataframe.loc[0] = ['breadginger@email.com', 'bread', 'ginger', 'female', 81]
people_dataframe

                    email first_name last_name     sex  age
0   breadginger@email.com      bread    ginger  female   81
1  baddiebaldie@email.com     baddie    baldie  female   27
2    mickeymann@email.com     mickey      mann    male   33
3   meggymuffin@email.com      meggy    muffin  female   15

In [32]:
# Modifying row values by index with selected columns
people_dataframe.loc[0, ['first_name', 'last_name']] = ['ginger', 'bread']
people_dataframe

                    email first_name last_name     sex  age
0   breadginger@email.com     ginger     bread  female   81
1  baddiebaldie@email.com     baddie    baldie  female   27
2    mickeymann@email.com     mickey      mann    male   33
3   meggymuffin@email.com      meggy    muffin  female   15

In [33]:
# Modifying single row values by index and column
people_dataframe.loc[0, 'age'] = 18
people_dataframe

                    email first_name last_name     sex  age
0   breadginger@email.com     ginger     bread  female   18
1  baddiebaldie@email.com     baddie    baldie  female   27
2    mickeymann@email.com     mickey      mann    male   33
3   meggymuffin@email.com      meggy    muffin  female   15

In [34]:
# Modifying row values with filter
filt = people_dataframe['first_name'] == 'mickey'
people_dataframe.loc[filt, 'first_name'] = 'mouse'
people_dataframe

                    email first_name last_name     sex  age
0   breadginger@email.com     ginger     bread  female   18
1  baddiebaldie@email.com     baddie    baldie  female   27
2    mickeymann@email.com      mouse      mann    male   33
3   meggymuffin@email.com      meggy    muffin  female   15

In [35]:
# Modifying row values
people_dataframe['first_name'].str.capitalize()

0    Ginger
1    Baddie
2     Mouse
3     Meggy
Name: first_name, dtype: object

In [36]:
# Modifying row values using apply method
people_dataframe['email'].apply(lambda x: x.upper())

0     BREADGINGER@EMAIL.COM
1    BADDIEBALDIE@EMAIL.COM
2      MICKEYMANN@EMAIL.COM
3     MEGGYMUFFIN@EMAIL.COM
Name: email, dtype: object

In [37]:
# Modifying all row values using applymap method
people_dataframe.loc[:, people_dataframe.columns != 'age'].applymap(str.capitalize)

                    email first_name last_name     sex
0   Breadginger@email.com     Ginger     Bread  Female
1  Baddiebaldie@email.com     Baddie    Baldie  Female
2    Mickeymann@email.com      Mouse      Mann    Male
3   Meggymuffin@email.com      Meggy    Muffin  Female

In [38]:
# Replacing multiple row values by column with map
people_dataframe['first_name'] = people_dataframe['first_name'].replace({'mouse' : 'mickey', 'meggy' : 'chungus'})
people_dataframe

                    email first_name last_name     sex  age
0   breadginger@email.com     ginger     bread  female   18
1  baddiebaldie@email.com     baddie    baldie  female   27
2    mickeymann@email.com     mickey      mann    male   33
3   meggymuffin@email.com    chungus    muffin  female   15

### Adding and removing rows and columns from the data frame

In [39]:
# Combining two columns and creating another column from it
people_dataframe['full_name'] = people_dataframe['first_name'] + ' ' + people_dataframe['last_name']
people_dataframe

                    email first_name last_name     sex  age       full_name
0   breadginger@email.com     ginger     bread  female   18    ginger bread
1  baddiebaldie@email.com     baddie    baldie  female   27   baddie baldie
2    mickeymann@email.com     mickey      mann    male   33     mickey mann
3   meggymuffin@email.com    chungus    muffin  female   15  chungus muffin

In [40]:
# Removing columns
people_dataframe.drop(columns=['first_name', 'last_name'], inplace=True)
people_dataframe

                    email     sex  age       full_name
0   breadginger@email.com  female   18    ginger bread
1  baddiebaldie@email.com  female   27   baddie baldie
2    mickeymann@email.com    male   33     mickey mann
3   meggymuffin@email.com  female   15  chungus muffin

In [41]:
# Creating new columns by splitting values from other columns
people_dataframe[['first_name', 'last_name']] = people_dataframe['full_name'].str.split(expand=True)
people_dataframe

                    email     sex  age       full_name first_name last_name
0   breadginger@email.com  female   18    ginger bread     ginger     bread
1  baddiebaldie@email.com  female   27   baddie baldie     baddie    baldie
2    mickeymann@email.com    male   33     mickey mann     mickey      mann
3   meggymuffin@email.com  female   15  chungus muffin    chungus    muffin

In [42]:
# Adding new column and values
people_dataframe = people_dataframe.assign(has_hands=[False, True, True, False])
people_dataframe

,email,sex,age,full_name,first_name,last_name,has_hands
0,breadginger@email.com,female,18,ginger bread,ginger,bread,False
1,baddiebaldie@email.com,female,27,baddie baldie,baddie,baldie,True
2,mickeymann@email.com,male,33,mickey mann,mickey,mann,True
3,meggymuffin@email.com,female,15,chungus muffin,chungus,muffin,False

In [43]:
# Adding dataframe to another dataframe
people2 = {
    'email' : ['bigpotato@email.com'],
    'sex' : ['male'],
    'age' : [25],
    'full_name' : ['big potato'],
    'first_name' : ['big'], 
    'last_name' : ['potato'],
    'has_hands' : [False],
}
people_dataframe_2 = pd.DataFrame(people2)

people_dataframe = people_dataframe.append(people_dataframe_2, ignore_index=True)
people_dataframe

,email,sex,age,full_name,first_name,last_name,has_hands
0,breadginger@email.com,female,18,ginger bread,ginger,bread,False
1,baddiebaldie@email.com,female,27,baddie baldie,baddie,baldie,True
2,mickeymann@email.com,male,33,mickey mann,mickey,mann,True
3,meggymuffin@email.com,female,15,chungus muffin,chungus,muffin,False
4,bigpotato@email.com,male,25,big potato,big,potato,False

In [44]:
# Adding new rows
people_dataframe.loc[len(people_dataframe.index)] = ['sammiacm@email.com', 'female', 45, 'sammi acm', 'sammi', 'acm', True]
people_dataframe

,email,sex,age,full_name,first_name,last_name,has_hands
0,breadginger@email.com,female,18,ginger bread,ginger,bread,False
1,baddiebaldie@email.com,female,27,baddie baldie,baddie,baldie,True
2,mickeymann@email.com,male,33,mickey mann,mickey,mann,True
3,meggymuffin@email.com,female,15,chungus muffin,chungus,muffin,False
4,bigpotato@email.com,male,25,big potato,big,potato,False
5,sammiacm@email.com,female,45,sammi acm,sammi,acm,True

In [45]:
# Removing rows by index with list comprehension
people_dataframe.drop(index=[x for x in range(4,people_dataframe.index.__len__())])

,email,sex,age,full_name,first_name,last_name,has_hands
0,breadginger@email.com,female,18,ginger bread,ginger,bread,False
1,baddiebaldie@email.com,female,27,baddie baldie,baddie,baldie,True
2,mickeymann@email.com,male,33,mickey mann,mickey,mann,True
3,meggymuffin@email.com,female,15,chungus muffin,chungus,muffin,False

In [46]:
# Removing rows by conditions
filt = (people_dataframe['first_name'] == 'big') | (people_dataframe['last_name'] == 'acm')
people_dataframe.drop(index=people_dataframe[filt].index)

,email,sex,age,full_name,first_name,last_name,has_hands
0,breadginger@email.com,female,18,ginger bread,ginger,bread,False
1,baddiebaldie@email.com,female,27,baddie baldie,baddie,baldie,True
2,mickeymann@email.com,male,33,mickey mann,mickey,mann,True
3,meggymuffin@email.com,female,15,chungus muffin,chungus,muffin,False

### Sorting data

In [47]:
# Sorting by single column
people_dataframe.sort_values(by=['full_name'], ascending=True)

,email,sex,age,full_name,first_name,last_name,has_hands
1,baddiebaldie@email.com,female,27,baddie baldie,baddie,baldie,True
4,bigpotato@email.com,male,25,big potato,big,potato,False
3,meggymuffin@email.com,female,15,chungus muffin,chungus,muffin,False
0,breadginger@email.com,female,18,ginger bread,ginger,bread,False
2,mickeymann@email.com,male,33,mickey mann,mickey,mann,True
5,sammiacm@email.com,female,45,sammi acm,sammi,acm,True

In [48]:
# Sorting by multiple columns
people_dataframe.sort_values(by=['first_name', 'age'], ascending=[True, False])

,email,sex,age,full_name,first_name,last_name,has_hands
1,baddiebaldie@email.com,female,27,baddie baldie,baddie,baldie,True
4,bigpotato@email.com,male,25,big potato,big,potato,False
3,meggymuffin@email.com,female,15,chungus muffin,chungus,muffin,False
0,breadginger@email.com,female,18,ginger bread,ginger,bread,False
2,mickeymann@email.com,male,33,mickey mann,mickey,mann,True
5,sammiacm@email.com,female,45,sammi acm,sammi,acm,True

In [49]:
# Single column sorting
people_dataframe['email'].sort_values(ascending=True)

1    baddiebaldie@email.com
4       bigpotato@email.com
0     breadginger@email.com
3     meggymuffin@email.com
2      mickeymann@email.com
5        sammiacm@email.com
Name: email, dtype: object

### Grouping and aggregating data

In [50]:
# Grouping data by a column and condition
sexuality_group = people_dataframe.groupby(by='sex')
sexuality_group.get_group(name='female')

,email,sex,age,full_name,first_name,last_name,has_hands
0,breadginger@email.com,female,18,ginger bread,ginger,bread,False
1,baddiebaldie@email.com,female,27,baddie baldie,baddie,baldie,True
3,meggymuffin@email.com,female,15,chungus muffin,chungus,muffin,False
5,sammiacm@email.com,female,45,sammi acm,sammi,acm,True

In [51]:
# Aggregating data by sex and tallying the age by count
sexuality_group['age'].value_counts()

sex     age
female  15     1
        18     1
        27     1
        45     1
male    25     1
        33     1
Name: age, dtype: int64

In [52]:
# Aggregating data and tallying the age by count with a given condition
sexuality_group['age'].value_counts(normalize=True).loc['male']

age
25    0.5
33    0.5
Name: age, dtype: float64

In [53]:
# Applying a single aggregate function to a grouped data
sexuality_group['age'].median()

sex
female    22.5
male      29.0
Name: age, dtype: float64

In [54]:
# Applying multiple aggregate function to a grouped data
sexuality_group['age'].agg(['median', 'mean'])

        median   mean
sex
female    22.5  26.25
male      29.0  29.00

In [55]:
# Grouping columns 
has_hands_group = people_dataframe.groupby(by='has_hands')
respondents_sexuality = people_dataframe['sex'].value_counts()
respondents_has_hands = has_hands_group['sex'].value_counts().get(True)
respondents_has_hands

sex
female    2
male      1
Name: sex, dtype: int64

In [58]:
# Concatenating grouped columns that has the same initial columns
age_sex_dataframe = pd.concat([respondents_sexuality, respondents_has_hands], axis='columns', keys=['sex','has_hands'])
age_sex_dataframe

        sex  has_hands
female    4          2
male      2          1

In [62]:
# Making a new column from the grouped data
age_sex_dataframe.assign(has_hands_percentage = (respondents_has_hands / respondents_sexuality) * 100)

        sex  has_hands  has_hands_percentage
female    4          2                  50.0
male      2          1                  50.0